tap "homebrew/cask"
tap "hashicorp/tap"
tap "powershell/tap"
tap "pulumi/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "siderolabs/tap"
tap "weaveworks/tap"

brew "powershell/tap/powershell"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-autocomplete"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-you-should-use"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "pulumi/tap/pulumi"
brew "kubernetes-cli"
brew "helm"
brew "jq"
brew "gh"
brew "yq"
brew "volta"
brew "docker"
brew "python"
brew "fzf"

brew "azure-cli"
brew "thefuck"
brew "starship"
brew "python"
brew "age"
brew "direnv"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "helm"
brew "helmfile"
brew "jq"
brew "kubeconform"
brew "kubernetes-cli"
brew "kustomize"
brew "moreutils"
brew "sops"
brew "stern"
brew "talhelper"
brew "siderolabs/tap/talosctl"
brew "weaveworks/tap/gitops"


# macos
brew "mas"
cask "1password/tap/1password-cli"
cask "git"

brew "karabiner-elements"
brew "jupyterlab"
cask "miniconda"
cask "iterm2"
cask "stats"
cask "google-chrome"
cask "google-chrome-beta"
cask "firefox"
cask "firefox-beta"
cask "microsoft-edge"
cask "microsoft-edge-beta"
cask "keybase"
cask "eul"
cask "gitkraken"
cask "royal-tsx"
cask "slack"
cask "microsoft-teams"
cask "gpg-suite"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-caskaydia-cove-nerd-font"
cask "font-cascadia-mono-pl"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-code"

cask "visual-studio"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "keybase"