main ./Brewfile.$OSTYPE

tap "homebrew/cask-fonts"
tap isen-ng/dotnet-sdk-versions
tap hashicorp/tap

brew powershell/tap/powershell
brew zsh
brew zsh-autosuggestions
brew zsh-autocomplete
brew zsh-syntax-highlighting
brew zsh-completions
brew zsh-you-should-use
brew hashicorp/tap/terraform
brew pulumi/tap/pulumi
brew kubernetes-cli
brew helm
brew jq
brew gh

brew "azure-cli"
brew "starship"
brew "python"

tap "fluxcd/tap"
tap "go-task/tap"
tap "siderolabs/tap"
brew "age"
brew "cloudflared"
brew "direnv"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "helm"
brew "helmfile"
brew "jq"
brew "kubeconform"
brew "kubernetes-cli"
brew "kustomize"
brew "moreutils"
brew "sops"
brew "stern"
brew "talhelper"
brew "talosctl"
brew "yq"
tap "weaveworks/tap"
brew "weaveworks/tap/gitops"
