tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
tap "powershell/tap"
tap "pulumi/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "siderolabs/tap"
tap "weaveworks/tap"
tap "fzf"



brew "powershell/tap/powershell"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-autocomplete"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-you-should-use"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "pulumi/tap/pulumi"
brew "kubernetes-cli"
brew "helm"
brew "jq"
brew "gh"
brew "yq"
brew "volta"
brew "docker"
brew "python"
cask "dotnet-sdk"
cask "git"

brew "azure-cli"
brew "thefuck"
brew "starship"
brew "python"
brew "age"
brew "direnv"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "helm"
brew "helmfile"
brew "jq"
brew "kubeconform"
brew "kubernetes-cli"
brew "kustomize"
brew "moreutils"
brew "sops"
brew "stern"
brew "talhelper"
brew "siderolabs/tap/talosctl"
brew "weaveworks/tap/gitops"

cask "1password/tap/1password-cli"
